
#include "zf_gpio.h"
#include "comparator.h"

#define COMPARATOR_MID_PIN  P3_6
#define COMPARATOR_A_PIN    P3_7
#define COMPARATOR_B_PIN    P5_1
#define COMPARATOR_C_PIN    P5_0


#define COMPARATOR_OUTPUT    0x0

//-------------------------------------------------------------------------------------------------------------------
//  @brief      姣旇緝鍣ㄩ€夋嫨A閫氶亾涓鸿緭鍏?//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_select_a(void)
{
    CMPEXCFG = 0x08;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      姣旇緝鍣ㄩ€夋嫨B閫氶亾涓鸿緭鍏?//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_select_b(void)
{
    CMPEXCFG = 0x0a;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      姣旇緝鍣ㄩ€夋嫨C閫氶亾涓鸿緭鍏?//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_select_c(void)
{
    CMPEXCFG = 0x09;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      璁剧疆姣旇緝鍣ㄤ笂鍗囨部瑙﹀彂涓柇
//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_rising(void)
{
    // 涓婂崌娌?    CMPCR1 = 0xAC | COMPARATOR_OUTPUT;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      璁剧疆姣旇緝鍣ㄤ笅闄嶆部瑙﹀彂涓柇
//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_falling(void)
{
    //涓嬮檷娌?    CMPCR1 = 0x9C | COMPARATOR_OUTPUT;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      鑾峰彇姣旇緝缁撴灉
//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
uint8 comparator_result_get(void)
{
    return (CMPCR1&0x01);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      鍏抽棴姣旇緝鍣ㄤ腑鏂?//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_close_isr(void)
{
    CMPCR1 = 0x8C | COMPARATOR_OUTPUT;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      姣旇緝鍣ㄥ垵濮嬪寲
//  @param      void                        
//  @return     void          
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void comparator_init(void)
{
    gpio_mode(COMPARATOR_MID_PIN, GPI_IMPEDANCE); // 涓€х偣
    gpio_mode(COMPARATOR_A_PIN  , GPI_IMPEDANCE); // A
	gpio_mode(COMPARATOR_B_PIN  , GPI_IMPEDANCE); // B
	gpio_mode(COMPARATOR_C_PIN  , GPI_IMPEDANCE); // C
    
    CMPCR1 = 0x8C;			// 1000 1100 鎵撳紑姣旇緝鍣紝P3.6浣滀负姣旇緝鍣ㄧ殑鍙嶇浉杈撳叆绔?	CMPCR2 = 63;			// 63涓椂閽熸护娉?  姣旇緝缁撴灉鍙樺寲寤舵椂鍛ㄦ湡鏁? 0~63
}

